# IdeaStatiCa.ConnectionApi.Model.AnchorGrid
Data of the anchor grid

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**ShearInThread** | **bool** | Indicates, whether a shear plane is in the thread of a bolt. | [optional]
**ConcreteBlock** | **ReferenceElement** |  | [optional]
**AnchorType** | **AnchorType** |  | [optional]
**AnchorInstallationProcess** | **InstallationProcessTypeEnum** |  | [optional]
**WasherSize** | **double** | Washer Size used if AnchorType is washer | [optional]
**AnchoringLength** | **double** | Anchoring Length | [optional]
**HookLength** | **double** | Length of anchor hook. Distance from the inner surface of the anchor shaft  to the outer tip of the hook specified as an anchor diameter multiplier. | [optional]
**HeadedStudHeadDiameter** | **double** | Head diameter of headed stud anchor.  Used when IdeaRS.OpenModel.Connection.AnchorGrid.AnchorType is IdeaRS.OpenModel.Parameters.AnchorType.HeadedStud. | [optional]
**ReinforcementMandrelDiameter** | **double** | Mandrel diameter of reinforcement anchor.  Used when IdeaRS.OpenModel.Connection.AnchorGrid.AnchorType is IdeaRS.OpenModel.Parameters.AnchorType.Reinforcement. | [optional]
**BoltAssembly** | **ReferenceElement** |  | [optional]
**Origin** | **Point3D** |  | [optional]
**AxisX** | **Vector3D** |  | [optional]
**AxisY** | **Vector3D** |  | [optional]
**AxisZ** | **Vector3D** |  | [optional]
**Positions** | **List&lt;Point3D&gt;** | Positions of holes in the local coordinate system of the grid | [optional]
**ConnectedParts** | **List&lt;ReferenceElement&gt;** | List of the connected parts | [optional]
**Name** | **string** | Name | [optional]
**Length** | **double** | Length | [optional]
**OriginalModelId** | **string** | Get or set the identification in the original model  In the case of the imported connection from another application | [optional]
**Id** | **int** | Element Id | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)